posts/use-easyswoole-the-right-way/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>EasySwoole 踩坑指南</title>
<meta name="keywords" content="珊瑚礁上的程序员, PHP, EasySwoole, Swoole" />
<meta name="generator" content="Org Mode" />
<link rel="icon" href="https://demokn.github.io/blog/favicon.ico" type="image/x-icon">
<link rel="stylesheet" href="https://demokn.github.io/blog/assets/lib/twitter-bootstrap/4.4.1/bootstrap.min.css">
<link rel="stylesheet" href="https://demokn.github.io/blog/assets/lib/font-awesome/5.12.1/all.min.css">
<link rel="stylesheet" type="text/css" href="https://fonts.googleapis.com/css?family=ZCOOL+KuaiLe|Amaranth|Handlee|Libre+Baskerville|Bree+Serif|Ubuntu+Mono|Pacifico&subset=latin,greek"/>
<link rel="stylesheet" href="https://demokn.github.io/blog/assets/css/site.css">
<link rel="stylesheet" href="https://demokn.github.io/blog/assets/css/highlight.css">
</head>
<body>
<div class="content-wrapper container">
<div class="row">
<div class="col-lg-8 col-md-10 mx-auto">

<div id="preamble" class="status">
<div class="banner">
  <a href="/" style="font-family: 'ZCOOL KuaiLe', cursive;"> 珊瑚礁上的程序员 </a>
</div>
<ul class="banner-links">
  <li><a href="https://demokn.github.io/blog/posts/archive.html"> Archive </a></li>
  <li><a href="https://demokn.github.io/blog/posts/rss.xml"> RSS </a></li>
  <li><a href="https://demokn.github.io/blog/about.html"> About </a></li>
</ul>
<hr>
</div>
<div id="article" class="content">
<header>
<h1 class="title">EasySwoole 踩坑指南</h1>
<p class="subtitle" role="doc-subtitle">发布于 2021-11-25</p>
</header>
<section id="outline-container-orgc64f719" class="outline-2">
<h2 id="orgc64f719">版本说明</h2>
<div class="outline-text-2" id="text-orgc64f719">
<pre class="example" id="orge62f573">
php version: 8.0.12
swoole version: 4.8.1
easyswoole version: 3.4.6
</pre>
</div>
</section>

<section id="outline-container-org6af8f6f" class="outline-2">
<h2 id="org6af8f6f">踩坑实践</h2>
<div class="outline-text-2" id="text-org6af8f6f">
</div>
<div id="outline-container-org72f363c" class="outline-3">
<h3 id="org72f363c">1. <code>TEMP_DIR</code> 配置必须使用绝对路径</h3>
<div class="outline-text-3" id="text-org72f363c">
<p>
临时文件存放的目录, 默认为框架根目录的 <code>Temp</code> 目录, 如需自定义, 务必要使用绝对路径, 否则会造成守护模式运行无法退出.
</p>
<div class="org-src-container">
<pre class="src src-shell">php easyswoole server stop
pid :4177803 not exist
</pre>
</div>

<p>
错误用法：
</p>
<div class="org-src-container">
<pre class="src src-php"><span class="org-php-string">'TEMP_DIR'</span> <span class="org-php-assignment-op">=</span><span class="org-php-comparison-op">&gt;</span> <span class="org-php-string">'./storage/temp'</span>,
</pre>
</div>

<p>
正确用法：
</p>
<div class="org-src-container">
<pre class="src src-php"><span class="org-php-string">'TEMP_DIR'</span> <span class="org-php-assignment-op">=</span><span class="org-php-comparison-op">&gt;</span> <span class="org-php-constant">EASYSWOOLE_ROOT</span> . <span class="org-php-string">'/storage/temp'</span>,
</pre>
</div>
</div>
</div>

<div id="outline-container-org6227fbc" class="outline-3">
<h3 id="org6227fbc">2. <code>ORM</code> 联表查询时, 要指定 <code>field()</code></h3>
<div class="outline-text-3" id="text-org6227fbc">
<p>
在 orm 中使用联表查询时, 务必要指定查询的字段, 一般就是 <code>YourTable.*</code>.
否则会造成不同表的同名字段值被覆盖的情况。
</p>

<p>
一些成熟框架的 <code>ORM</code> 其实都会对这种联表查询的情况自动处理, 例如 <code>Yii2</code>
</p>
<div class="org-src-container">
<pre class="src src-php"><span class="org-comment-delimiter">// </span><span class="org-comment">\yii\db\ActiveQuery::prepare()</span>
<span class="org-php-keyword">if</span> (<span class="org-php-keyword">empty</span>(<span class="org-php-this-sigil">$</span><span class="org-php-this">this</span><span class="org-php-object-op">-&gt;</span><span class="org-php-property-name">select</span>) <span class="org-php-logical-op">&amp;&amp;</span> <span class="org-php-logical-op">!</span><span class="org-php-keyword">empty</span>(<span class="org-php-this-sigil">$</span><span class="org-php-this">this</span><span class="org-php-object-op">-&gt;</span><span class="org-php-property-name">join</span>)) {
    <span class="org-php-keyword">list</span>(, <span class="org-php-variable-sigil">$</span><span class="org-php-variable-name">alias</span>) <span class="org-php-assignment-op">=</span> <span class="org-php-this-sigil">$</span><span class="org-php-this">this</span><span class="org-php-object-op">-&gt;</span><span class="org-php-method-call-traditional">getTableNameAndAlias</span>();
    <span class="org-php-this-sigil">$</span><span class="org-php-this">this</span><span class="org-php-object-op">-&gt;</span><span class="org-php-property-name">select</span> <span class="org-php-assignment-op">=</span> [<span class="org-php-string">"</span><span class="org-php-variable-name">$alias</span><span class="org-php-string">.*"</span>];
}
</pre>
</div>
<p>
但 <code>EasySwoole</code> 目前的版本确实还是需要自己手动指定查询字段.
</p>

<p>
错误用法：
</p>
<div class="org-src-container">
<pre class="src src-php"><span class="org-php-variable-sigil">$</span><span class="org-php-variable-name">articles</span> <span class="org-php-assignment-op">=</span> <span class="org-php-constant">Article</span><span class="org-php-paamayim-nekudotayim">::</span><span class="org-php-static-method-call-traditional">create</span>()
    <span class="org-php-object-op">-&gt;</span><span class="org-php-method-call-traditional">join</span>(<span class="org-php-string">'author'</span>, <span class="org-php-string">'author.id=article.author'</span>, <span class="org-php-string">'INNER'</span>)
    <span class="org-php-object-op">-&gt;</span><span class="org-php-method-call-traditional">all</span>();
<span class="org-comment-delimiter">// </span><span class="org-comment">author &#34920;&#20013;&#30340; id &#20250;&#35206;&#30422; article &#34920;&#20013;&#30340; id</span>
</pre>
</div>

<p>
正确用法：
</p>
<div class="org-src-container">
<pre class="src src-php"><span class="org-php-variable-sigil">$</span><span class="org-php-variable-name">articles</span> <span class="org-php-assignment-op">=</span> <span class="org-php-constant">Article</span><span class="org-php-paamayim-nekudotayim">::</span><span class="org-php-static-method-call-traditional">create</span>()
    <span class="org-php-object-op">-&gt;</span><span class="org-php-method-call-traditional">with</span>([<span class="org-php-string">'author'</span>])
    <span class="org-php-object-op">-&gt;</span><span class="org-php-method-call-traditional">field</span>(<span class="org-php-string">'article.*'</span>)
    <span class="org-php-object-op">-&gt;</span><span class="org-php-method-call-traditional">join</span>(<span class="org-php-string">'author'</span>, <span class="org-php-string">'author.id=article.author'</span>, <span class="org-php-string">'INNER'</span>)
    <span class="org-php-object-op">-&gt;</span><span class="org-php-method-call-traditional">all</span>();
</pre>
</div>
</div>
</div>

<div id="outline-container-orge666e8d" class="outline-3">
<h3 id="orge666e8d">3. 不要使用 <code>ORM</code> 和 <code>QueryBuilder</code> 的 <code>withTotalCount()</code> 方法</h3>
<div class="outline-text-3" id="text-orge666e8d">
<p>
<code>withTotalCount</code> 查询总条数的方式是通过 <code>SQL_CALC_FOUND_ROWS</code> 查询选项 + <code>select FOUND_ROWS()</code> 实现的,
并非我们平常使用的 <code>select count(*)</code> 方式.
<code>SQL_CALC_FOUND_ROWS</code> 查询选项在 mysql 8.0 版本已经被 <a href="https://dev.mysql.com/doc/refman/8.0/en/information-functions.html#function_found-rows">标记为废弃</a> 了，所以不建议使用.
而且, 在实际使用过程中, 确实出现了无法预知的结果。(阿里云 RDS + 读写分离)
</p>

<p>
错误用法：
</p>
<div class="org-src-container">
<pre class="src src-php"><span class="org-php-variable-sigil">$</span><span class="org-php-variable-name">query</span> <span class="org-php-assignment-op">=</span> <span class="org-php-constant">Article</span><span class="org-php-paamayim-nekudotayim">::</span><span class="org-php-static-method-call-traditional">create</span>()
    <span class="org-php-object-op">-&gt;</span><span class="org-php-method-call-traditional">withTotalCount</span>()
    <span class="org-php-object-op">-&gt;</span><span class="org-php-method-call-traditional">limit</span>(10, 5);
<span class="org-php-variable-sigil">$</span><span class="org-php-variable-name">articles</span> <span class="org-php-assignment-op">=</span> <span class="org-php-variable-sigil">$</span><span class="org-php-variable-name">query</span><span class="org-php-object-op">-&gt;</span><span class="org-php-method-call-traditional">all</span>();
<span class="org-php-variable-sigil">$</span><span class="org-php-variable-name">totalCount</span> <span class="org-php-assignment-op">=</span> <span class="org-php-variable-sigil">$</span><span class="org-php-variable-name">query</span><span class="org-php-object-op">-&gt;</span><span class="org-php-method-call-traditional">lastQueryResult</span>()<span class="org-php-object-op">-&gt;</span><span class="org-php-method-call-traditional">getTotalCount</span>();
</pre>
</div>

<p>
正确用法：
</p>
<div class="org-src-container">
<pre class="src src-php"><span class="org-php-variable-sigil">$</span><span class="org-php-variable-name">query</span> <span class="org-php-assignment-op">=</span> <span class="org-php-constant">Article</span><span class="org-php-paamayim-nekudotayim">::</span><span class="org-php-static-method-call-traditional">create</span>();
<span class="org-php-variable-sigil">$</span><span class="org-php-variable-name">totalCount</span> <span class="org-php-assignment-op">=</span> (<span class="org-php-keyword">clone</span> <span class="org-php-variable-sigil">$</span><span class="org-php-variable-name">query</span>)<span class="org-php-object-op">-&gt;</span><span class="org-php-method-call-traditional">count</span>();
<span class="org-php-variable-sigil">$</span><span class="org-php-variable-name">articles</span> <span class="org-php-assignment-op">=</span> <span class="org-php-variable-sigil">$</span><span class="org-php-variable-name">query</span><span class="org-php-object-op">-&gt;</span><span class="org-php-method-call-traditional">limit</span>(10, 5)<span class="org-php-object-op">-&gt;</span><span class="org-php-method-call-traditional">all</span>();
</pre>
</div>
</div>
</div>
